In [171]:
import requests
import pandas as pd
import json
import sqlite3
from datetime import datetime

In [172]:
r = requests.get('https://collectionapi.metmuseum.org/public/collection/v1/departments')

creating a variable to store the data

In [173]:
art_data = r.json()

In [174]:
df = pd.DataFrame(art_data)

In [175]:
df.head()

                                         departments
0  {'departmentId': 1, 'displayName': 'American D...
1  {'departmentId': 3, 'displayName': 'Ancient Ne...
2  {'departmentId': 4, 'displayName': 'Arms and A...
3  {'departmentId': 5, 'displayName': 'Arts of Af...
4    {'departmentId': 6, 'displayName': 'Asian Art'}

In [176]:
df.describe()

                                              departments
count                                                  19
unique                                                 19
top     {'departmentId': 1, 'displayName': 'American D...
freq                                                    1

We have 19 unique departments to pull data from. What are they?

In [177]:
print (df)

                                          departments
0   {'departmentId': 1, 'displayName': 'American D...
1   {'departmentId': 3, 'displayName': 'Ancient Ne...
2   {'departmentId': 4, 'displayName': 'Arms and A...
3   {'departmentId': 5, 'displayName': 'Arts of Af...
4     {'departmentId': 6, 'displayName': 'Asian Art'}
5   {'departmentId': 7, 'displayName': 'The Cloist...
6   {'departmentId': 8, 'displayName': 'The Costum...
7   {'departmentId': 9, 'displayName': 'Drawings a...
8   {'departmentId': 10, 'displayName': 'Egyptian ...
9   {'departmentId': 11, 'displayName': 'European ...
10  {'departmentId': 12, 'displayName': 'European ...
11  {'departmentId': 13, 'displayName': 'Greek and...
12  {'departmentId': 14, 'displayName': 'Islamic A...
13  {'departmentId': 15, 'displayName': 'The Rober...
14  {'departmentId': 16, 'displayName': 'The Libra...
15  {'departmentId': 17, 'displayName': 'Medieval ...
16  {'departmentId': 18, 'displayName': 'Musical I...
17  {'departmentId': 19, 'displayName': 'Photograp...
18  {'departmentId': 21, 'displayName': 'Modern Art'}

Okay. I think I want to work with a specific collection next. Medieval Art sounds interesting. Department ID #17. Let's pull that one next.

In [178]:
r2 = requests.get('https://collectionapi.metmuseum.org/public/collection/v1/objects?departmentIds=17')

In [179]:
art_data2=r2.json()

Create another variable to store this new df.

In [180]:
df2 = pd.DataFrame(art_data2)

Let's see what we have to work with.

In [181]:
df2.head()

   total  objectIDs
0   7142      32830
1   7142      32831
2   7142      32832
3   7142      32833
4   7142      32834

There are 7142 items in this collection.

In [182]:
df2.tail()

      total  objectIDs
7137   7142     729827
7138   7142     729829
7139   7142     729830
7140   7142     831188
7141   7142     841757

Let's pull info on a random object in this collection.

In [183]:
r3=requests.get('https://collectionapi.metmuseum.org/public/collection/v1/objects/812961')

In [184]:
object_data=r3.json()

What info is available for this random object?

In [185]:
print(object_data)

{'objectID': 812961, 'isHighlight': False, 'accessionNumber': '2018.913.5', 'accessionYear': '2018', 'isPublicDomain': True, 'primaryImage': 'https://images.metmuseum.org/CRDImages/md/original/LC_TR_311_6_2018-s01.jpg', 'primaryImageSmall': 'https://images.metmuseum.org/CRDImages/md/web-large/LC_TR_311_6_2018-s01.jpg', 'additionalImages': [], 'constituents': None, 'department': 'Medieval Art', 'objectName': 'Textile', 'title': 'Wool Roundel with Mythological Animal', 'culture': 'Egyptian', 'period': '', 'dynasty': '', 'reign': '', 'portfolio': '', 'artistRole': '', 'artistPrefix': '', 'artistDisplayName': '', 'artistDisplayBio': '', 'artistSuffix': '', 'artistAlphaSort': '', 'artistNationality': '', 'artistBeginDate': '', 'artistEndDate': '', 'artistGender': '', 'artistWikidata_URL': '', 'artistULAN_URL': '', 'objectDate': '7th–9th century', 'objectBeginDate': 600, 'objectEndDate': 900, 'medium': 'Polychrome wool and undyed linen; tapestry weave', 'dimensions': '8 3/8 × 5 3/16 in. (21.3 × 13.1 cm)\r\nMount: 11 5/8 × 8 1/16 × 1 3/16 in. (29.5 × 20.4 × 3 cm)', 'measurements': [{'elementName': 'Overall', 'elementDescription': None, 'elementMeasurements': {'Height': 21.3, 'Width': 13.1}}, {'elementName': 'Mount', 'elementDescription': None, 'elementMeasurements': {'Depth': 3, 'Height': 29.5, 'Width': 20.4}}], 'creditLine': 'Gift of Dr. Marilyn Jenkins-Madina, in loving memory of her husband, Professor Maan Z. Madina, 2018', 'geographyType': '', 'city': '', 'state': '', 'county': '', 'country': '', 'region': '', 'subregion': '', 'locale': '', 'locus': '', 'excavation': '', 'river': '', 'classification': 'Textiles-Woven', 'rightsAndReproduction': '', 'linkResource': '', 'metadataDate': '2020-03-31T04:44:12.95Z', 'repository': 'Metropolitan Museum of Art, New York, NY', 'objectURL': 'https://www.metmuseum.org/art/collection/search/812961', 'tags': None, 'objectWikidata_URL': '', 'isTimelineWork': False, 'GalleryNumber': ''}

How do I see all the objects listed as 'Egyptian' culture within the Medieval Art dataset? Let's try some SQL.

In [186]:
conn = sqlite3.connect('art_data2')

Added a SQL connection and created a database file "art_data2".

In [187]:
cursor = conn.cursor()

Create empty SQLite table

In [194]:
art_stuff = """CREATE TABLE art_stuff (
    objectID INTEGER PRIMARY KEY,
    isHighlight VARCHAR(255),
    accessionNumber VARCHAR(255),
    accessionYear VARCHAR(255),
    isPublicDomain VARCHAR(255),
    primaryImage VARCHAR(255),
    primaryImageSmall VARCHAR(255),
    additionalImagesVARCHAR(255),
    constituents VARCHAR(255),
    department VARCHAR(255),
    objectName VARCHAR(255),
    title VARCHAR(255),
    culture VARCHAR(255),
    period VARCHAR(255),
    dynasty VARCHAR(255),
    reign VARCHAR(255),
    portfolio VARCHAR(255),
    artistRole VARCHAR(255),
    artistPrefix VARCHAR(255),
    artistDisplayName VARCHAR(255),
    artistDisplayBio VARCHAR(255),
    artistSuffix VARCHAR(255),
    artistAlphaSort VARCHAR(255),
    artistNationality VARCHAR(255),
    artistBeginDate VARCHAR(255),
    artistEndDate VARCHAR(255),
    artistGender VARCHAR(255),
    artistWikidata_URL VARCHAR(255),
    artistULAN_URL VARCHAR(255),
    objectDate VARCHAR(255),
    objectBeginDate VARCHAR(255),
    objectEndDate VARCHAR(255),
    medium VARCHAR(255),
    dimensions VARCHAR(255),
    measurements VARCHAR(255),
    creditLine VARCHAR(255),
    geographyType VARCHAR(255),
    city VARCHAR(255),
    state VARCHAR(255),
    county VARCHAR(255),
    country VARCHAR(255),
    region VARCHAR(255),
    subregion VARCHAR(255),
    locale VARCHAR(255),
    locus VARCHAR(255),
    excavation VARCHAR(255),
    river VARCHAR(255),
    classification VARCHAR(255),
    rightsAndReproduction VARCHAR(255),
    linkResource VARCHAR(255),
    metadataDate VARCHAR(255),
    repository VARCHAR(255),
    objectURL VARCHAR(255),
    tags VARCHAR(255),
    objectWikidata_URL VARCHAR(255),
    isTimelineWork VARCHAR(255),
    GalleryNumber VARCHAR(255);"""

Add all the data from the Medieval Art dataset to the empty sql database we just created.

In [196]:
df2.to_sql(art_stuff, conn, if_exists='append', index=False)

7142